docs/tracking/principles/PROTOCOLS_AS_TYPES.org
#+TITLE: Protocols as Types: Composable Session Types in Prologos
#+AUTHOR: Prologos Project
#+DATE: 2026-03-05

* The Insight

Session types are types. Continuations are type positions. Named session types
can appear in continuation positions. Therefore: *protocols compose through
the type system with no additional mechanism.*

A session type describes a communication protocol. After each operation (send,
receive, select, offer), there is a continuation --- a type describing "what
comes next." When that continuation is a named session type, the protocol
*transitions into a different protocol*. The type checker verifies the
transition. The channel remains the same; only the protocol changes.

This is not syntactic sugar, not a macro expansion, not a runtime dispatch. It
is the natural consequence of session types being first-class types in a
dependently-typed language. Composition falls out of the type system for free.

* Composition Patterns

Three composition patterns emerge from this insight, none requiring new
mechanisms beyond what session types already provide.

** Pattern 1: Phase Transition (Sequential Composition)

A session type's continuation names the next phase of the protocol:

#+begin_src prologos
session Handshake
  ! Version . ? Version . Authenticated     ;; after handshake → authenticate

session Authenticated
  ! Credentials
  ? [Result Token AuthError]
  +>
    | :ok   -> Ready                         ;; success → operational phase
    | :fail -> end                            ;; failure → done

session Ready
  +>
    | :query -> ! String . ? [Result Rows DbError] . Ready
    | :close -> end
#+end_src

The protocol flows: ~Handshake → Authenticated → Ready → (loop) → end~. Each
phase is a named type. Each transition is verified by the type checker. The
*author* of each session type decides what comes next --- ~Handshake~ declares
"after me comes ~Authenticated~," not the caller.

** Pattern 2: Mode Branching

Choice operators (~+>~ / ~&>~) can branch into different sub-protocols:

#+begin_src prologos
session DatabaseSession
  +>
    | :query  -> QueryMode
    | :admin  -> AdminMode
    | :close  -> end

session QueryMode
  ! String . ! [List Param] .
  ? [Result [List Row] DbError] .
  DatabaseSession                             ;; return to main protocol

session AdminMode
  +>
    | :vacuum -> ? [Result Unit DbError] . DatabaseSession
    | :backup -> ! Path . ? [Result Unit DbError] . DatabaseSession
#+end_src

This is *mutual recursion between protocols*. ~DatabaseSession~ branches to
~QueryMode~, which does its work, then transitions back to ~DatabaseSession~.
The protocol graph can be arbitrarily complex --- any directed graph of named
session types is expressible.

** Pattern 3: Inline Prefix with Named Continuation

Operations are written inline, with a named type taking over as the final
continuation:

#+begin_src prologos
session SecureFileSession
  ! Version . ? Version .                      ;; inline handshake operations
  ! Credentials . ? [Result Token AuthError] . ;; inline auth operations
  FileOps                                       ;; named type takes over
#+end_src

This is the most direct form of "do these things, then become that protocol."
The inline prefix is protocol-specific; the named continuation is reusable.

* What This Means: Protocol Libraries

Composition through types means session types become *building blocks*. A
protocol library is a collection of named session types, each describing a
reusable phase of interaction:

#+begin_src prologos
;; --- Protocol building blocks ---

session Handshake
  ! Version . ? Version . Authenticated

session Authenticated
  ! Credentials . ? [Result Token AuthError] .
  +> | :ok -> Ready
     | :fail -> end

;; --- Domain protocols built from blocks ---

session Ready
  +>
    | :query -> QueryMode
    | :close -> end

session SecureDbSession
  Handshake                   ;; starts with handshake → authenticated → ready
  ;; (the chain follows from Handshake's continuation declarations)
#+end_src

Each block is independently testable, independently verifiable, and
independently documentable. Complex protocols are assembled from simple,
well-understood components.

