docs/tracking/principles/PROTOCOLS_AS_TYPES.tex
% Created 2026-03-05 Thu 16:16
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{The Prologos Project - from Zachary Larson}
\date{2026-03-05}
\title{Protocols as Types: Composable Session Types in Prologos}
\hypersetup{
 pdfauthor={The Prologos Project - from Zachary Larson},
 pdftitle={Protocols as Types: Composable Session Types in Prologos},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.39)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{The Insight}
\label{sec:org1f97f50}

Session types are types. Continuations are type positions. Named session types
can appear in continuation positions. Therefore: \textbf{protocols compose through
the type system with no additional mechanism.}

A session type describes a communication protocol. After each operation (send,
receive, select, offer), there is a continuation --- a type describing "what
comes next." When that continuation is a named session type, the protocol
\textbf{transitions into a different protocol}. The type checker verifies the
transition. The channel remains the same; only the protocol changes.

This is not syntactic sugar, not a macro expansion, not a runtime dispatch. It
is the natural consequence of session types being first-class types in a
dependently-typed language. Composition falls out of the type system for free.
\section{Composition Patterns}
\label{sec:orgcd3a82a}

Three composition patterns emerge from this insight, none requiring new
mechanisms beyond what session types already provide.
\subsection{Pattern 1: Phase Transition (Sequential Composition)}
\label{sec:org1261dbb}

A session type's continuation names the next phase of the protocol:

\begin{verbatim}
session Handshake
  ! Version . ? Version . Authenticated  ;; after handshake → authenticate

session Authenticated
  ! Credentials
  ? [Result Token AuthError]
  +>
    | :ok   -> Ready             ;; success → operational phase
    | :fail -> end               ;; failure → done

session Ready
  +>
    | :query -> ! String . ? [Result Rows DbError] . Ready
    | :close -> end
\end{verbatim}

The protocol flows: \texttt{Handshake → Authenticated → Ready → (loop) → end}. Each
phase is a named type. Each transition is verified by the type checker. The
\textbf{author} of each session type decides what comes next --- \texttt{Handshake} declares
"after me comes \texttt{Authenticated}," not the caller.
\subsection{Pattern 2: Mode Branching}
\label{sec:orgc116149}

Choice operators (\texttt{+>} / \texttt{\&>}) can branch into different sub-protocols:

\begin{verbatim}
session DatabaseSession
  +>
    | :query  -> QueryMode
    | :admin  -> AdminMode
    | :close  -> end

session QueryMode
  ! String . ! [List Param] .
  ? [Result [List Row] DbError] .
  DatabaseSession                    ;; return to main protocol

session AdminMode
  +>
    | :vacuum -> ? [Result Unit DbError] . DatabaseSession
    | :backup -> ! Path . ? [Result Unit DbError] . DatabaseSession
\end{verbatim}

This is \textbf{mutual recursion between protocols}. \texttt{DatabaseSession} branches to
\texttt{QueryMode}, which does its work, then transitions back to \texttt{DatabaseSession}.
The protocol graph can be arbitrarily complex --- any directed graph of named
session types is expressible.
\subsection{Pattern 3: Inline Prefix with Named Continuation}
\label{sec:org4b2223c}

Operations are written inline, with a named type taking over as the final
continuation:

\begin{verbatim}
session SecureFileSession
  ! Version . ? Version .                      ;; inline handshake operations
  ! Credentials . ? [Result Token AuthError] . ;; inline auth operations
  FileOps                                      ;; named type takes over
\end{verbatim}

This is the most direct form of "do these things, then become that protocol."
The inline prefix is protocol-specific; the named continuation is reusable.
\section{What This Means: Protocol Libraries}
\label{sec:org5554b17}

Composition through types means session types become \textbf{building blocks}. A
protocol library is a collection of named session types, each describing a
reusable phase of interaction:

\begin{verbatim}
;; --- Protocol building blocks ---

session Handshake
  ! Version . ? Version . Authenticated

session Authenticated
  ! Credentials . ? [Result Token AuthError] .
  +> | :ok -> Ready
     | :fail -> end

;; --- Domain protocols built from blocks ---

session Ready
  +>
    | :query -> QueryMode
    | :close -> end

session SecureDbSession
  Handshake               ;; starts with handshake → authenticated → ready
  ;; (the chain follows from Handshake's continuation declarations)
\end{verbatim}

Each block is independently testable, independently verifiable, and
independently documentable. Complex protocols are assembled from simple,
well-understood components.
