docs/tracking/principles/PROTOCOLS_AS_TYPES.org
* The State Machine Interpretation

Named session types are states. Operations within a session type are
transitions. The continuation after each operation names the next state.

#+begin_example
                    Handshake
                       │
              ! Version . ? Version
                       │
                       ▼
                 Authenticated
                       │
            ! Credentials . ? Result
                       │
                  ┌────┴────┐
                  ▼         ▼
               Ready      end
                │
         ┌──────┼──────┐
         ▼      ▼      ▼
     QueryMode  │    end
         │      │
         └──────┘
      (returns to Ready)
#+end_example

This is a typed, verified finite state machine. Every transition is
type-checked. Dead states are impossible (the type checker rejects protocols
that don't reach ~end~). Invalid transitions are type errors. The session type
*is* the state machine specification.

* The ~end~ Question: Intentional Design, Not Missing Feature

A natural question arises: if ~Handshake~ ends with ~end~, can we compose it
with ~Auth~ by replacing ~end~ with ~Auth~?

#+begin_src prologos
;; Both are complete, terminal protocols:
session Handshake
  ! Version . ? Version . end

session Auth
  ! Credentials . ? Token . end

;; Can we write this?
;; session Composed = Handshake . Auth    ;; hypothetical end-splicing
#+end_src

This would require *end-splicing* --- a type-level operation that substitutes
~end~ in one protocol with the start of another. Prologos *deliberately does
not do this*, for principled reasons.

** Why End-Splicing Is Rejected

End-splicing introduces semantic complications:

1. *Multiple exit points*: A protocol with several branches reaching ~end~
   would have all of them spliced. Is that always what the author intended?

2. *Recursive protocol interaction*: If a protocol has recursive
   self-references (~rec~) and ~end~ branches, splicing ~end~ must create a
   new recursive type where the self-references point to the spliced version.
   This requires type-level rewriting of recursive bindings.

3. *Mixed continuations*: If some branches end with ~end~ and others with
   named types, which ~end~​s get spliced? The semantics become ambiguous.

4. *Retroactive composition*: A protocol defined with ~end~ was designed as
   terminal. Retroactively composing it changes its meaning without changing
   its definition. This violates referential transparency at the type level.

** The Intentionality Principle

When ~Handshake~ says ~end~, it means "/I am done --- the connection is
finished/." When ~Handshake~ says ~. Authenticated~, it means "/I am a phase,
and after me comes authentication/." These are different protocols with
different meanings.

A handshake-then-close and a handshake-then-authenticate are not the same
handshake with different suffixes. They are different commitments. The
named-continuation approach makes protocol composition *intentional*:

- The *author* of a session type declares what comes next
- A protocol defined with ~end~ is *complete* --- it is not a composable prefix
- A protocol defined with a named continuation is *open* --- it transitions
  to another protocol
- This distinction is explicit, visible in the type definition, and
  enforced by the type checker

This is analogous to the difference between a function that returns ~A~ and a
function that takes a continuation ~(A -> B) -> B~. Both are useful; neither
is the other.

** Making Protocols Composable

If a protocol author intends their protocol to be used as a composable phase,
they define it with a named continuation:

#+begin_src prologos
;; Reusable: author explicitly says "something comes after me"
session Handshake
  ! Version . ? Version . Authenticated     ;; open: transitions to Authenticated

;; Terminal: author explicitly says "I'm the end"
session HandshakeDone
  ! Version . ? Version . end               ;; closed: terminates
#+end_src

Two types, two intentions, both clear. No machinery needed to distinguish them.
The author's intent is visible in the type definition.

