docs/tracking/principles/PROTOCOLS_AS_TYPES.tex
\section{The State Machine Interpretation}
\label{sec:org8db9adc}

Named session types are states. Operations within a session type are
transitions. The continuation after each operation names the next state.

\begin{verbatim}
               Handshake
                  │
         ! Version . ? Version
                  │
                  ▼
            Authenticated
                  │
       ! Credentials . ? Result
                  │
             ┌────┴────┐
             ▼         ▼
          Ready      end
           │
    ┌──────┼──────┐
    ▼      ▼      ▼
QueryMode  │    end
    │      │
    └──────┘
 (returns to Ready)
\end{verbatim}

This is a typed, verified finite state machine. Every transition is
type-checked. Dead states are impossible (the type checker rejects protocols
that don't reach \texttt{end}). Invalid transitions are type errors. The session type
\textbf{is} the state machine specification.
\section{The \texttt{end} Question: Intentional Design, Not Missing Feature}
\label{sec:org59a0019}

A natural question arises: if \texttt{Handshake} ends with \texttt{end}, can we compose it
with \texttt{Auth} by replacing \texttt{end} with \texttt{Auth}?

\begin{verbatim}
;; Both are complete, terminal protocols:
session Handshake
  ! Version . ? Version . end

session Auth
  ! Credentials . ? Token . end

;; Can we write this?
;; session Composed = Handshake . Auth    ;; hypothetical end-splicing
\end{verbatim}

This would require \textbf{end-splicing} --- a type-level operation that substitutes
\texttt{end} in one protocol with the start of another. Prologos \textbf{deliberately does
not do this}, for principled reasons.
\subsection{Why End-Splicing Is Rejected}
\label{sec:org81e1389}

End-splicing introduces semantic complications:

\begin{enumerate}
\item \textbf{Multiple exit points}: A protocol with several branches reaching \texttt{end}
would have all of them spliced. Is that always what the author intended?

\item \textbf{Recursive protocol interaction}: If a protocol has recursive
self-references (\texttt{rec}) and \texttt{end} branches, splicing \texttt{end} must create a
new recursive type where the self-references point to the spliced version.
This requires type-level rewriting of recursive bindings.

\item \textbf{Mixed continuations}: If some branches end with \texttt{end} and others with
named types, which \texttt{end}​s get spliced? The semantics become ambiguous.

\item \textbf{Retroactive composition}: A protocol defined with \texttt{end} was designed as
terminal. Retroactively composing it changes its meaning without changing
its definition. This violates referential transparency at the type level.
\end{enumerate}
\subsection{The Intentionality Principle}
\label{sec:orgfcd196b}

When \texttt{Handshake} says \texttt{end}, it means "\emph{I am done --- the connection is
finished}." When \texttt{Handshake} says \texttt{. Authenticated}, it means "\emph{I am a phase,
and after me comes authentication}." These are different protocols with
different meanings.

A handshake-then-close and a handshake-then-authenticate are not the same
handshake with different suffixes. They are different commitments. The
named-continuation approach makes protocol composition \textbf{intentional}:

\begin{itemize}
\item The \textbf{author} of a session type declares what comes next
\item A protocol defined with \texttt{end} is \textbf{complete} --- it is not a composable prefix
\item A protocol defined with a named continuation is \textbf{open} --- it transitions
to another protocol
\item This distinction is explicit, visible in the type definition, and
enforced by the type checker
\end{itemize}

This is analogous to the difference between a function that returns \texttt{A} and a
function that takes a continuation \texttt{(A -> B) -> B}. Both are useful; neither
is the other.
\subsection{Making Protocols Composable}
\label{sec:orgfc697e3}

If a protocol author intends their protocol to be used as a composable phase,
they define it with a named continuation:

\begin{verbatim}
;; Reusable: author explicitly says "something comes after me"
session Handshake
  ! Version . ? Version . Authenticated     ;; open: transitions to Authenticated

;; Terminal: author explicitly says "I'm the end"
session HandshakeDone
  ! Version . ? Version . end               ;; closed: terminates
\end{verbatim}

Two types, two intentions, both clear. No machinery needed to distinguish them.
The author's intent is visible in the type definition.
