docs/tracking/principles/PROTOCOLS_AS_TYPES.tex
\section{Capability Composition}
\label{sec:org8a0e235}

When protocols compose, capabilities compose with them. Each named session type
can carry capability requirements. The composed protocol's requirements are the
union of its constituents':

\begin{verbatim}
;; Each phase has its own capability requirements
session Handshake {net :0 TlsCap}
  ! ClientHello . ? ServerHello . Authenticated

session Authenticated {net :0 AuthCap}
  ! Credentials . ? Token . Ready

session Ready {fs :0 ReadCap}
  +>
    | :read -> ! Path . ? String . Ready
    | :done -> end
\end{verbatim}

A process implementing the full \texttt{Handshake → Authenticated → Ready} chain
requires \texttt{\{net :0 TlsCap, net :0 AuthCap, fs :0 ReadCap\}} --- the union of
all phase requirements. The compiler computes this automatically. At runtime,
\texttt{:0} capabilities are erased --- zero cost for authority verification.

This means:
\begin{itemize}
\item \textbf{Protocols compose} --- named types in continuation position
\item \textbf{Capabilities compose} --- union of per-phase requirements
\item \textbf{Types verify the whole thing} --- the compiler checks authority at every
phase transition
\item \textbf{Runtime cost is zero} --- \texttt{:0} authority proofs are erased
\end{itemize}
\section{Relationship to Existing Type System Features}
\label{sec:orgfcf0b2f}

Protocol composition through types is not an isolated feature. It connects
to and reinforces several existing Prologos design principles:
\subsection{Session Types as Layer 5}
\label{sec:org16fa2c1}

The Layered Architecture (DESIGN\textsubscript{PRINCIPLES} §Layered Architecture) places
protocols at Layer 5 (\texttt{session}) and processes at Layer 6 (\texttt{defproc}). Protocol
composition works entirely within Layer 5 --- it is a property of protocol
specifications, independent of process implementation. A \texttt{defproc} implements
one endpoint of a (possibly composed) protocol; it does not need to know
whether the protocol was assembled from multiple named session types.
\subsection{Decomplection of Protocol and Process}
\label{sec:org051ff39}

DESIGN\textsubscript{PRINCIPLES} §Decomplection establishes that protocol specification
(\texttt{session}) is decoupled from process implementation (\texttt{defproc}). Protocol
composition deepens this decomplection: complex protocols can be assembled
from simple building blocks at the type level, without any corresponding
complexity in the process implementation. The process sees a single session
type; whether it was composed from three named types or defined monolithically
is invisible.
\subsection{Duality Composes}
\label{sec:org061ba85}

Session type duality is preserved through composition. If \texttt{Handshake}
transitions to \texttt{Auth}, then \texttt{dual Handshake} transitions to \texttt{dual Auth}. The
type checker verifies duality for the entire composed protocol, not just each
phase independently. This ensures end-to-end protocol safety.
\subsection{Progressive Disclosure}
\label{sec:org11a5e1c}

Protocol composition is a Tier 3 feature --- expert users building complex
concurrent systems. Tier 1 users (\texttt{defn main}) never see session types. Tier 2
users (\texttt{with-open}) interact with single, monolithic protocols. Only users who
need multi-phase, multi-protocol architectures encounter composition. The
complexity is opt-in, following the Disappearing Features principle
(ERGONOMICS §Guiding Principle).
\section{Theoretical Foundations}
\label{sec:org52cf036}

Protocol composition through types has roots in several lines of research,
but Prologos's specific combination is novel.
\subsection{Curry-Howard for Linear Logic (Toninho, Caires, Pfenning, 2011)}
\label{sec:org3fa04f8}

Session types correspond to linear logic propositions under the Curry-Howard
correspondence. Protocol composition corresponds to the \textbf{cut rule} --- the
most fundamental operation in logic. Sequencing protocols is logically
equivalent to composing proofs. The theoretical foundation for what Prologos
does is as old as linear logic itself.
\subsection{Polymorphic Session Types (Caires et al., 2013)}
\label{sec:org3334997}

Session types parameterized by other types, including continuation types. This
gives the formal machinery for open-ended protocols:
\texttt{Handshake[K] = ! Version . ? Version . K}. Prologos achieves the same
effect through named continuations without requiring explicit type parameters.
\subsection{Context-Free Session Types (Thiemann \& Vasconcelos, 2016; Padovani, 2017)}
\label{sec:org496050b}

Extensions that allow session types to express context-free languages, not
just regular languages. This gives more expressive composition at the cost of
decidability for some properties. Prologos stays within the regular fragment
(tail-recursive protocols) for decidability guarantees.
\subsection{Scribble (Honda, Yoshida, et al.)}
\label{sec:orga195220}

A protocol description language for multiparty session types that supports
protocol modules. The closest existing practical tool to protocol composition.
But Scribble is a specification language --- protocols are described, not typed.
Prologos makes protocols first-class types in the programming language itself.
