docs/tracking/principles/PROTOCOLS_AS_TYPES.md


<a id="org2c9474f"></a>

# Capability Composition

When protocols compose, capabilities compose with them. Each named session type can carry capability requirements. The composed protocol's requirements are the union of its constituents':

```prologos
;; Each phase has its own capability requirements
session Handshake {net :0 TlsCap}
  ! ClientHello . ? ServerHello . Authenticated

session Authenticated {net :0 AuthCap}
  ! Credentials . ? Token . Ready

session Ready {fs :0 ReadCap}
  +>
    | :read -> ! Path . ? String . Ready
    | :done -> end
```

A process implementing the full `Handshake → Authenticated → Ready` chain requires `{net :0 TlsCap, net :0 AuthCap, fs :0 ReadCap}` &#x2014; the union of all phase requirements. The compiler computes this automatically. At runtime, `:0` capabilities are erased &#x2014; zero cost for authority verification.

This means:

-   **Protocols compose** &#x2014; named types in continuation position
-   **Capabilities compose** &#x2014; union of per-phase requirements
-   **Types verify the whole thing** &#x2014; the compiler checks authority at every phase transition
-   **Runtime cost is zero** &#x2014; `:0` authority proofs are erased


<a id="orgbe918c6"></a>

# Relationship to Existing Type System Features

Protocol composition through types is not an isolated feature. It connects to and reinforces several existing Prologos design principles:


<a id="org4a42962"></a>

## Session Types as Layer 5

The Layered Architecture (DESIGN<sub>PRINCIPLES</sub> §Layered Architecture) places protocols at Layer 5 (`session`) and processes at Layer 6 (`defproc`). Protocol composition works entirely within Layer 5 &#x2014; it is a property of protocol specifications, independent of process implementation. A `defproc` implements one endpoint of a (possibly composed) protocol; it does not need to know whether the protocol was assembled from multiple named session types.


<a id="orgd044da7"></a>

## Decomplection of Protocol and Process

DESIGN<sub>PRINCIPLES</sub> §Decomplection establishes that protocol specification (`session`) is decoupled from process implementation (`defproc`). Protocol composition deepens this decomplection: complex protocols can be assembled from simple building blocks at the type level, without any corresponding complexity in the process implementation. The process sees a single session type; whether it was composed from three named types or defined monolithically is invisible.


<a id="org5b061fd"></a>

## Duality Composes

Session type duality is preserved through composition. If `Handshake` transitions to `Auth`, then `dual Handshake` transitions to `dual Auth`. The type checker verifies duality for the entire composed protocol, not just each phase independently. This ensures end-to-end protocol safety.


<a id="org51da36a"></a>

## Progressive Disclosure

Protocol composition is a Tier 3 feature &#x2014; expert users building complex concurrent systems. Tier 1 users (`defn main`) never see session types. Tier 2 users (`with-open`) interact with single, monolithic protocols. Only users who need multi-phase, multi-protocol architectures encounter composition. The complexity is opt-in, following the Disappearing Features principle (ERGONOMICS §Guiding Principle).


<a id="orge606e45"></a>

# Theoretical Foundations

Protocol composition through types has roots in several lines of research, but Prologos's specific combination is novel.


<a id="orgb580268"></a>

## Curry-Howard for Linear Logic (Toninho, Caires, Pfenning, 2011)

Session types correspond to linear logic propositions under the Curry-Howard correspondence. Protocol composition corresponds to the **cut rule** &#x2014; the most fundamental operation in logic. Sequencing protocols is logically equivalent to composing proofs. The theoretical foundation for what Prologos does is as old as linear logic itself.


<a id="orgdaa8645"></a>

## Polymorphic Session Types (Caires et al., 2013)

Session types parameterized by other types, including continuation types. This gives the formal machinery for open-ended protocols: `Handshake[K] = ! Version . ? Version . K`. Prologos achieves the same effect through named continuations without requiring explicit type parameters.


<a id="orgdfef4e5"></a>

## Context-Free Session Types (Thiemann & Vasconcelos, 2016; Padovani, 2017)

Extensions that allow session types to express context-free languages, not just regular languages. This gives more expressive composition at the cost of decidability for some properties. Prologos stays within the regular fragment (tail-recursive protocols) for decidability guarantees.


<a id="org16fdb09"></a>

## Scribble (Honda, Yoshida, et al.)

A protocol description language for multiparty session types that supports protocol modules. The closest existing practical tool to protocol composition. But Scribble is a specification language &#x2014; protocols are described, not typed. Prologos makes protocols first-class types in the programming language itself.
