docs/tracking/principles/PROTOCOLS_AS_TYPES.tex
\subsection{What Is Novel}
\label{sec:orgc6e0047}

The \textbf{combination} is novel:

\begin{enumerate}
\item Named session types as composable building blocks within a programming
language (not a separate specification language)
\item Capability composition tracking alongside protocol composition
\item Propagator-based runtime that schedules composed protocols efficiently
\item Progressive disclosure --- composition is opt-in, not forced
\item The intentionality principle --- \texttt{end} means terminal, named continuations
mean composable, and the distinction is a design choice
\end{enumerate}

No existing language or tool unifies all five. The individual pieces are
well-understood; the synthesis is new.
\section{Design Principles for Protocol Composition}
\label{sec:org599fa57}

\begin{enumerate}
\item \textbf{Protocols Are Types.} A session type is a first-class type. It can appear
anywhere a type can appear --- as a continuation, as a type parameter, as a
constraint. Protocol composition is type composition.

\item \textbf{Composition Is Intentional.} The author of a session type decides whether
it is composable (named continuation) or terminal (\texttt{end}). Composition is
not retroactive. The type definition is a commitment.

\item \textbf{Named Continuations, Not End-Splicing.} Protocols compose through named
types in continuation position. There is no mechanism to replace \texttt{end} in a
complete protocol with a continuation. The distinction between open and
closed protocols is part of the protocol's meaning.

\item \textbf{Capabilities Compose With Protocols.} When protocols compose, their
capability requirements compose via union. The compiler tracks authority
through every phase transition. Authority verification is free (\texttt{:0} erased).

\item \textbf{Duality Is Preserved.} Protocol composition preserves the duality
invariant. If server-side composes phases A → B → C, the client-side sees
dual(A) → dual(B) → dual(C). End-to-end safety is guaranteed.

\item \textbf{State Machines Are Types.} The protocol graph (named session types as
states, operations as transitions) is verified by the type checker. Dead
states, invalid transitions, and stuck channels are type errors.

\item \textbf{Progressive Disclosure.} Simple protocols are simple to define. Composition
is available when needed but never required. A monolithic \texttt{session} that
does everything inline is always valid.
\end{enumerate}
\section{Relationship to Other Principles}
\label{sec:org905386c}

\begin{center}
\begin{tabular}{ll}
Document & Relationship\\
\hline
\texttt{DESIGN\_PRINCIPLES.org} & "Correctness Through Types" --- protocol composition is type composition. "Decomplection" --- protocol spec decoupled from process impl. "Layered Architecture" --- composition operates at Layer 5.\\
\texttt{LANGUAGE\_VISION.org} & "Protocol correctness" (§What Problem Does Prologos Solve?) extends from single protocols to composed protocols. "Session Types as Protocol Specifications" (§Cutting-Edge Research) gains composability.\\
\texttt{CAPABILITY\_SECURITY.md} & "Session Types and Capability Protocols" (§Session Types) --- capability delegation follows composed protocol structure. Capability requirements union across composed phases.\\
\texttt{ERGONOMICS.org} & "Disappearing Features" --- composition is Tier 3, invisible to beginners. Progressive disclosure governs when users encounter it.\\
\texttt{LANGUAGE\_DESIGN.org} & "Session Types as Protocol Specifications" (§Session Types) --- composition extends the specification power of session types. Duality, recursion, and choice all compose naturally.\\
\texttt{PATTERNS\_AND\_CONVENTIONS.org} & Session type naming patterns extend to composed protocols. Each named phase follows the same naming conventions.\\
IO Library Design V2 & The IO design uses protocol composition extensively: \texttt{Handshake → Auth → FileOps} patterns, branching into sub-protocols, mode transitions.\\
\end{tabular}
\end{center}
\section{Implications for the Language}
\label{sec:org8fb1dbc}

\subsection{Protocol Libraries Become Possible}
\label{sec:org05ba1fc}

Named, composable session types enable a \textbf{standard library of protocols} ---
reusable communication patterns that users can compose into application-specific
protocols. Examples:

\begin{itemize}
\item \texttt{Handshake} --- version negotiation
\item \texttt{TlsHandshake} --- TLS setup
\item \texttt{Auth} --- credential exchange
\item \texttt{Heartbeat} --- keepalive with timeout
\item \texttt{Pagination} --- cursor-based result traversal
\end{itemize}

These would live in \texttt{prologos.core.protocols} and compose freely.
\subsection{Testing Protocols in Isolation}
\label{sec:org76da910}

Each named session type can be tested independently. A test for \texttt{QueryMode}
doesn't need to set up the full \texttt{DatabaseSession → QueryMode} chain --- it
directly tests the \texttt{QueryMode} protocol against a mock endpoint. This mirrors
how pure functions are tested independently of their callers.
