docs/tracking/principles/PROTOCOLS_AS_TYPES.org
** Error Handling at Phase Boundaries

Errors at phase transitions --- authentication failure, handshake mismatch ---
are type-level events. A branch to ~end~ at the wrong phase is visible in the
type. Error protocols can be composed just like success protocols:

#+begin_src prologos
session Authenticated
  ! Credentials . ? [Result Token AuthError] .
  +>
    | :ok   -> Ready
    | :fail -> ErrorRecovery           ;; transition to error protocol

session ErrorRecovery
  ! RetryRequest . ? [Result Token AuthError] .
  +>
    | :ok    -> Ready
    | :fail  -> end                     ;; final failure
#+end_src

** AI Agent Protocols

Multi-agent communication (LANGUAGE_VISION §AI Agent Infrastructure) benefits
directly from protocol composition. Agent interaction protocols are built from
composable phases:

#+begin_src prologos
session AgentNegotiation
  ! Proposal . ? CounterProposal .
  +>
    | :accept -> CollaborativeWork
    | :counter -> AgentNegotiation     ;; re-negotiate
    | :reject -> end

session CollaborativeWork
  rec
    +>
      | :delegate -> ! Task . ? Result . CollaborativeWork
      | :report   -> ! Summary . end
#+end_src

The session type guarantees that agents follow the negotiation protocol, that
delegation respects authority boundaries (via capabilities), and that the
collaboration terminates.

* Inspirations

- *Toninho, Caires, Pfenning* --- Session types as propositions (Curry-Howard
  for linear logic). Protocol composition = cut rule. The deepest theoretical
  foundation for this work.
- *Honda, Yoshida, Carbone* --- Multiparty session types and the Scribble
  protocol description language. The closest practical precedent for protocol
  modularity.
- *Lindley & Morris* --- Semantics for propositions as sessions. The cut rule
  gives composition; our named continuations are a user-facing expression
  of the same operation.
- *Padovani* --- Context-free session types. Shows that session types can
  express more than regular languages, though we stay within the regular
  fragment for decidability.
- *Mark Miller (E language)* --- Object-capability model. Capabilities compose
  through delegation; our capability composition through protocol composition
  mirrors this at the type level.
