docs/tracking/principles/PROTOCOLS_AS_TYPES.md


<a id="org7e144e4"></a>

## Error Handling at Phase Boundaries

Errors at phase transitions &#x2014; authentication failure, handshake mismatch &#x2014; are type-level events. A branch to `end` at the wrong phase is visible in the type. Error protocols can be composed just like success protocols:

```prologos
session Authenticated
  ! Credentials . ? [Result Token AuthError] .
  +>
    | :ok   -> Ready
    | :fail -> ErrorRecovery           ;; transition to error protocol

session ErrorRecovery
  ! RetryRequest . ? [Result Token AuthError] .
  +>
    | :ok    -> Ready
    | :fail  -> end                     ;; final failure
```


<a id="org1023637"></a>

## AI Agent Protocols

Multi-agent communication (LANGUAGE<sub>VISION</sub> §AI Agent Infrastructure) benefits directly from protocol composition. Agent interaction protocols are built from composable phases:

```prologos
session AgentNegotiation
  ! Proposal . ? CounterProposal .
  +>
    | :accept -> CollaborativeWork
    | :counter -> AgentNegotiation     ;; re-negotiate
    | :reject -> end

session CollaborativeWork
  rec
    +>
      | :delegate -> ! Task . ? Result . CollaborativeWork
      | :report   -> ! Summary . end
```

The session type guarantees that agents follow the negotiation protocol, that delegation respects authority boundaries (via capabilities), and that the collaboration terminates.


<a id="org8c8be5d"></a>

# Inspirations

-   **Toninho, Caires, Pfenning** &#x2014; Session types as propositions (Curry-Howard for linear logic). Protocol composition = cut rule. The deepest theoretical foundation for this work.
-   **Honda, Yoshida, Carbone** &#x2014; Multiparty session types and the Scribble protocol description language. The closest practical precedent for protocol modularity.
-   **Lindley & Morris** &#x2014; Semantics for propositions as sessions. The cut rule gives composition; our named continuations are a user-facing expression of the same operation.
-   **Padovani** &#x2014; Context-free session types. Shows that session types can express more than regular languages, though we stay within the regular fragment for decidability.
-   **Mark Miller (E language)** &#x2014; Object-capability model. Capabilities compose through delegation; our capability composition through protocol composition mirrors this at the type level.
